app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
        # binding.pry
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Spanish"], ["room_number", 102]]

    def update
        @school_class = SchoolClass.update(params.require(:school_class).permit(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Biology"], ["room_number", 100], ["id", 1]]