app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Chadwick"], ["last_name", "Boseman"], ["updated_at", "2020-09-03 16:52:25.920874"], ["id", 1]]
---
    def update
        @student = Student.update(params.require(:student).permit(:first_name, :last_name))